/*Задача 5	Напишите программу, которая вводит натуральные числа a и b , и выводит сумму квадратов натуральных чисел в диапазоне от a до b .
Входные данные
Входная строк содержит два натуральных числа – границы диапазона a и b . Гарантируется, что a ? b .
Выходные данные
Программа должна вывести одно число – сумму квадратов натуральных чисел из диапазона [ a , b ] .

*/

#include <iostream>
#include <cstdlib>
#include <cmath>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Rus");

	int a,b,summa;
	summa=0;
	
	cout<<"Введите 2 числа\n";
	cin>>a>>b;
	
	if ( (a<=0) || (b<=0)||(a>=b))
		cout<<"Ошибка";
	else {
	for (int i=a;i<=b;i++)
	{
	summa=i*i+summa;

	}
	cout<<"Сумма квадратов равна "<<summa;	
	}
	
		cin.get();
	cin.get();
return 0;
}