/*Задача 2	Напишите программу, которая вводит натуральное число N и находит сумму всех натуральных чисел от 1 до N .
Входные данные
Входная строка содержит единственное целое число N .
Выходные данные
Программа должна вывести сумму натуральных чисел от 1 до введённого числа N .
*/

#include <iostream>
#include <cstdlib>
#include <cmath>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Rus");

	int n, summa;

	cout << "Введите число\n";
	cin >> n;
	summa = 0;
	if (n <= 0)									//проверяем натуральность введенного n
		cout << "Ошибка";
	else {
		for (int i = 1; i <= n; i++)			//цикл будет выполняться пока счетчик не достигнет n (т.е. выполнится n раз) 
		{
			summa += i;
		}


		cout << "Сумма равна " << "    " << summa;
	}
	cin.get();
	cin.get();
	return 0;
}