/*Задача 6	Напишите программу, которая вводит натуральные числа a , b и N , и выводит на экран N псевдослучайных целых чисел на отрезке [ a , b ] .
Входные данные
Входная строка содержит три числа, разделённые пробелами: границы отрезка a и b и требуемое количество чисел N . Гарантируется, что a ? b .
Выходные данные
Программа должна вывести N случайных целых чисел в одной строке, разделив их пробелами.
*/

#include <iostream>
#include <cstdlib>
#include <cmath>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Rus");

	int a,b,n,sluch;
	
	cout<<"Введите 3 числа\n";
	cin>>a>>b>>n;
	
	if ( (n<=0)||(a>=b))
		cout<<"Ошибка";
	else {
	for (int i=1;i<=n;i++)
	{
		sluch=rand()%(b-a+1)+a;
		cout<<sluch<<" ";
	}
	}
	cin.get();
	cin.get();
return 0;
}