/*Задача 4	Напишите программу, которая вводит натуральные числа a и b , и выводит квадраты натуральных чисел в диапазоне [ a , b ] .
Входные данные
Входная строка содержит два натуральных числа – значения a и b . Гарантируется, что a ? b .
Выходные данные
Программа должна вывести квадраты чисел в диапазоне [ a , b ] и показать способ вычисления. Например, если ввести 4 и 5, программа должна вывести
*/

#include <iostream>
#include <cstdlib>
#include <cmath>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Rus");

	int a,b;
	
	cout<<"Введите 2 числа\n";
	cin>>a>>b;
	
	if ( (a<=0) || (b<=0)||(a>=b))
		cout<<"Ошибка";
	else {
	for (int i=a;i<=b;i++)
	{
		cout<<i<<"*"<<i<<"= ";
		cout<<i*i<<endl;
	}
	}
	cin.get();
	cin.get();
return 0;
}