/*Задача 3	Напишите программу, которая вводит натуральное число N и выводит первые N чётных натуральных чисел.
Входные данные
Входная строка содержит единственное число – требуемое количество чисел N .
Выходные данные
Программа должна вывести в одну строчку N первых чётных натуральных чисел, разделив их пробелами.
*/

#include <iostream>
#include <cstdlib>
#include <cmath>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Rus");

	int n;
	
	cout<<"Введите число\n";
	cin>>n;
	
	if ( n<=0 )
		cout<<"Ошибка";
	else {
	for (int i=0;i<n;i++)
	{
		cout<<i*2<<" ";
	}
	}
	cin.get();
	cin.get();
return 0;
}