/*Задача 7	Напишите программу, которая считает сумму цифр введённого числа.
Входные данные
Входная строка содержит одно натуральное число.
Выходные данные
Программа должна вывести сумму цифр введённого числа.

*/

#include <iostream>
#include <cstdlib>
#include <cmath>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Rus");

	int a, summa, i;								//создаем здесь счетчик i, чтобы счетчик был виден в остальных частях программы, а не только в цикле
	summa = 0;
	cout << "Введите число\n";
	cin >> a;

	if (a <= 0)
		cout << "Ошибка";
	else {
		for (i = 10; (a / i != 0);)
		{
			summa = a % i + summa;					//сумма=остаток от деления числа на i (i сначала равно 10, потом 100, 1000...)
			a = a / 10;
		}
		summa = a % i + summa;					//когда вышли из цикла от числа а осталась только первая цифра, i=10^K (K=количества цифр)
		cout << "Сумма равна:" << summa;
	}
	cin.get();
	cin.get();
	return 0;
}