/*Задача 9	Напишите программу, которая вводит с клавиатуры числа до тех пор,
пока не будет введено число 0. В конце работы программы на экран выводится минимальное и максимальное из введенных чисел (не считая 0).
Входные данные
На вход программы подаются целые числа, по одному в строке. Ввод завершается числом 0.
Выходные данные
Программа должна вывести минимальное и максимальное из введенных чисел (не считая 0) в одной строке через пробел.
*/

#include <iostream>
#include <cstdlib>
#include <cmath>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Rus");

	int a, max, min;
	
	cout << "Введите числа, если закончили, введите 0\n";
	cin >> a;
	if (a == 0)
		cout << "Первым числом вы ввели 0, максимальное и минимальное числа не могут быть определены" << endl;
	else {
		min = a;
		max = a;

		for (; a != 0;) {
			cin >> a;
			if (max < a)
				max = a;
			if (a != 0) {
				if (min > a)
				min = a;
			}
		}
		if (max == min)
			cout << "Минимальное и максимальное число совпали\n" << "min = " << "max = " << min;
		else {
			cout << min << " " << max << endl;
			cout << "Максимальное число:" << max << endl;
			cout << "Минимальное число: " << min;
		}
	}
	cin.get();
	cin.get();
	return 0;
}