/*Задача 8	Напишите программу, которая вычисляет сумму и произведение целых чисел, поданных на её вход. Ввод заканчивается числом 0.
Входные данные
Во входных строках записаны целые числа, по одному в каждой строке. В последней строке записано число 0.
Выходные данные
Программа должна вывести в одной строке сумму и произведение введённых чисел (не считая завершающий 0), разделив их пробелом.
*/

#include <iostream>
#include <cstdlib>
#include <cmath>
using namespace std;
int main()
{
	setlocale(LC_ALL, "Rus");

	int a,summa,proiz;
	summa=0;
	proiz=1;
	a=1;
	cout<<"Введите числа\n";
	
	while (a!=0)
	{
		cin>>a;
		if (a!=0)
		proiz*=a;
		summa+=a;

	}				
		cout<<"Сумма равна:"<<summa<<endl;
		cout<<"Произведение равно:"<<proiz;
	cin.get();
	cin.get();
return 0;
}