/*10. В операционной системе путь к файлу состоит из имени логического диска и названий каталогов, в которых находится этот файл. Части пути разделены знаками "\" (обратный слэш). 
Требуется разбить заданный путь к файлу на части — имя диска и названия каталогов.
Входные данные
Входная строка содержит путь к файлу.(C:\WINDOWS\WORK\my.txt)

Выходные данные
Программа должна вывести имя диска и названия всех каталогов, составляющих путь. Каждый элемент выводится в отдельной строке.


*/
#include <iostream>
#include <string>
using namespace std;

int main() 
{
	
	setlocale(LC_ALL, "Rus");
	string str ("C:\\WINDOWS\\WORK\\my.txt");
	//getline(cin, str);					//если надо вводить с клавы, то раскомментировать и удалить инициализацию с предыдущей строки							
	
	int pos = str.rfind('\\');				//ищет последний слэш, запоминает позицию, можно объединить со следующей строкой
	string namefile = str.substr(pos+1);			//запоминает в переменную подстроку данной строки=имя файла
	str = str.erase(pos);					//меняет размер у первоначальной строки, стирая имя файла
	int sizestr = str.size();				//запоминает в переменную новый размер строки

	for (int i = 0; i < sizestr; i++)	
	{
		if (str[i] == ':')
			cout << "Имя диска " << str[i - 1] << endl;
		if ((str[i] == '\\')&&((i+1)<sizestr))					//проверяет не является ли слэш последним символом строки
		{
			int j;
			cout << "имя каталога ";
			for (j = i+1; (str[j] != '\\')&&(j<sizestr); j++)
				cout << str[j];						//выводит посимвольно после слэша
			i = j-1;
			cout << endl;
		}
	}

	cout << "Имя файла " << namefile << endl;					//выводит имя файла 
	
	return 0;
}
