/*05. Напишите программу, которая выводит последнее слово переданной её символьной строки. 
Входные данные
Входная строка содержит произвольную последовательность символов.
Выходные данные
Программа должна вывести последнее слово этой строки.


*/

#include <iostream>
#include <string>

int main ()
{
	setlocale (LC_ALL,"Rus");
	using namespace std;
	string str;
	
	cout<<"введите строчку"<<endl;
	
	getline (cin,str);
	cout<<endl;
	int length=str.length();
	int lengthslova=1;
	int i;
	for (i=length-1; (str[i]!=' ')&&(str[i]!='\n')&&(i>0); i--)
	{lengthslova+=1;

	}
	
	cout<<str.substr((length-lengthslova), lengthslova)<<endl;

	cin.get();
	cin.get();

return 0;
}