/*08. Напишите программу, которая определяет, является ли введённое слово (без пробелов) палиндромом, то есть верно ли, что оно читается одинаково слева направо и справа налево.
Входные данные
Входная строка содержит слово – последовательность символов без пробелов.
Выходные данные
Программа должна вывести слово 'YES', если введённое слово – палиндром, и слово 'NO', если оно не является палиндромом.

*/
#include <iostream>
#include <string>
using namespace std;

int main() 
{
	
	setlocale(LC_ALL, "Rus");
	string str;
	getline(cin, str);												
	
	bool palindrom (0);
	
	
	for (int i = 0, j = (str.size()-1); i < j; i++, j--)	//i j это индексы для первой и последней буквы, j=длина строки -1, поскольку строка кончается \n , а начинается с позиции 0, 
															//то надо отнимать 1
	{
		
		if (str[i] != str[j])
		{
			palindrom = 0;
			cout << "NO" << endl;
			return 0;
		}
		else palindrom = 1;
	}

	if (palindrom)
		cout << "YES" << endl;
	
	return 0;
}