/*07. Напишите программу, которая считает количество слов в символьной строке. 

Входные данные
Входная строка содержит произвольные печатаемые символы.
Выходные данные
Программа должна вывести одно число – количество слов в переданной её строке.
*/
#include <iostream>
#include <string>
using namespace std;
int wordsize(string, int);
int main() 
{
	
	setlocale(LC_ALL, "Rus");
	string str;
	int kolichestvoSlov(0);
	
	getline(cin, str);												
	int sizeword(0);											//длина слова
	
	for (int i = 0; i < (str.size()); i += sizeword + 1)		//шаг цикла =длина слова +1 , добавить 1 нужно, чтобы начало следующей проверки было с буквы, а не пробела (иначе зациклится)
	{
		sizeword = wordsize(str, i);							//в функции подсчитывается количество букв в слове: передается строка и позиция, с которой нужно считать количество знаков в слове
		if (sizeword != 0)
			kolichestvoSlov += 1;
		
	}
	cout << kolichestvoSlov;

	return 0;
}
int wordsize(string str, int beginword)
{
	int wsize (0);
	for (int i = beginword; i <= (str.size()); i++)				//цикл начинается с заданной позиции, шаг цикла 1 (т.к. проверяется каждый символ), 
																//действует пока текущий символ не станет больше размера строки 
																//(если сделать строго <, то при достижении конца строки вернет 0 без захода в тело цикла)
	{
		if ((str[i] != ' ') && (str[i] != '\n') && (i != str.size())) //проверяется не равен ли символ пробелу, символу конца строки или не равна ли текущая позиция размеру строки
			wsize += 1;
		else return wsize;
	}
	return 0;
}