/*14. Напишите программу, которая определяет, сколько раз встречается подстрока в символьной строке.

Входные данные
Первая строка содержит исходную символьную строку. Вторая строка содержит подстроку-образец.
Выходные данные
Программа должна вывести одно число – количество вхождений подстроки-образца в исходную строку.



*/
#include <iostream>
#include <string>
#include <windows.h>
using namespace std;
int Podschet(string str, string strobraz) {
	int size = str.size();
	int pos1=0;
	int kolvozamen=0;
	for (int i = 0; i < size; i++)
	{
		pos1 = str.find(strobraz, i);
		if (pos1 != std::string::npos)
		{
			kolvozamen++;
			i = pos1;
		}
		else i = size;
	}

	return kolvozamen;
}
int main() 
{
	
	setlocale(LC_ALL, "Rus");
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	string str, strobraz,strzam;
	str = "сделать из муха слон";
	strobraz = "муха";
	strzam = "слон";
	//getline(cin, str);			//можно сделать ручной ввод
	cout << "Первоначальная строка: \n" << str << endl ;
	int kolvozamen=Podschet(str, strobraz);
	
	cout  << kolvozamen<<endl<<endl;
	return 0;
}