/*09. Напишите программу, которая определяет, является ли заданная строка (возможно, содержащая пробелы) палиндромом, то есть верно ли, что она после удаления пробелов читается одинаково слева направо и справа налево.
Входные данные
Входная строка – последовательность символов, возможно, содержащая пробелы.
Выходные данные
Программа должна вывести слово 'YES', если введённая строка – палиндром, и слово 'NO', если она не является палиндромом.


*/
#include <iostream>
#include <string>
using namespace std;

int main() 
{
	
	setlocale(LC_ALL, "Rus");
	string str;
	getline(cin, str);												
	
	bool palindrom (0);
	string str1=str;
	int kolprob = 0;
	for (int i = 0, j=0; i < str.size(); i++, j++)
	{
		if (str[i] != ' ')
			str1[j] = str[i];
		else {
			j--;
			kolprob++;
		}
	}
	str1.resize((str.size())-kolprob);
	for (int i = 0, j = (str1.size()-1); i < j; i++, j--)	//i j это индексы для первой и последней буквы, j=длина строки -1, поскольку строка кончается \n , а начинается с позиции 0, 
															//то надо отнимать 1
	{
		
		if (str1[i] != str1[j])
		{
			palindrom = 0;
			cout << "NO" << endl;
			return 0;
		}
		else palindrom = 1;
	}

	if (palindrom)
		cout << "YES" << endl;
	
	return 0;
}