/*03. Напишите программу, которая заменяет в символьной строке все буквы a на буквы b , буквы A на буквы B , буквы b на буквы a и буквы B на буквы A .
Входные данные
Входная строка содержит символы латинского алфавита, как строчные, так и заглавные.
Выходные данные
Программа должна вывести в первой строке получившуюся в результате обработки символьную строку, а во второй – количество выполненных замен.


*/

#include <iostream>
#include <string>

int main ()
{
	setlocale (LC_ALL,"Rus");
	using namespace std;
	string str;
	
	cout<<"введите строчку"<<endl;
	cin>>str;
	cout<<endl;
	int length=str.length();
	int kolvozamen=0;
	for (int i=0; i<length; i++)
	{
		if (str[i]=='a')
		{str[i]='1';
		kolvozamen+=1;}
		if (str[i]=='A')
		{str[i]='2';
		kolvozamen+=1;}
		if (str[i]=='b')
		{str[i]='3';
		kolvozamen+=1;}
		if (str[i]=='B')
		{str[i]='4';
		kolvozamen+=1;}
		
	}
	for (int i=0; i<length; i++)
	{
		switch (str[i]) {
		case '1': str[i]='b';
			break;
		case '2': str[i]='B';
			break;
		case '3': str[i]='a';
			break;
		case '4': str[i]='A';
			break;	
		}
	}
	
	cout<<str<<endl<<"выполнено замен "<<kolvozamen<<endl;

	cin.get();
	cin.get();

return 0;
}