/*11. Напишите программу, которая преобразует строку, содержащую имя, отчество и фамилию человека, к форме фамилия и инициалы. (Иванов Иван Иванович   Иванов И.И.)


*/
#include <iostream>
#include <string>
#include <windows.h>
using namespace std;

int main() 
{
	
	setlocale(LC_ALL, "Rus");
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	string str;
	getline(cin, str);
	int pos1 = str.find(' ')+1;				//ищет позицию первого пробела
	int pos2 = str.rfind(' ') + 1;			//ищет позицию последнего пробела
	string str1 = str;
	int sizeold = str.size();
	int sizenew = pos1;
	str1.resize(sizenew);
	str1 = str1 + str.substr(pos1,1) + '.' + str.substr(pos2,1) + '.';
	cout << endl << str1;
	return 0;
}

