/*15. Напишите программу, которая заменяет расширение у заданного имени файла.

Входные данные
Первая строка содержит имя файла, которое нужно изменить. Во второй строке записано нужное расширение.
Выходные данные
Программа должна вывести изменённое имя файла с заданным расширением.



*/
#include <iostream>
#include <string>
#include <windows.h>
using namespace std;

int main() 
{
	
	setlocale(LC_ALL, "Rus");
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	
	string str, str1;
	str = "FileName.doc";
	str1 ={".txt"};
	int pos=str.find ('.');
	int size1 = str.size();
	if (pos!=std::string::npos)
		str.resize(pos+size1);
	str = str.substr(0, pos) + str1;
	//getline(cin, str);			//можно сделать ручной ввод
	cout <<  str << endl ;
	
	return 0;
}
