/*1. Напишите программу, которая заполняет массив первыми N натуральными числами и выводит его
Входные данные
Входная строка содержит размер массива N . Гарантируется, что 0 < N ≤ 10000 .
Выходные данные
Программа должна вывести содержимое массива: N последовательных натуральных чисел от 1 до N .

*/
#include <iostream>
#include <string>
#include <windows.h>
#include <iomanip>
using namespace std;

int main() 
{
	setlocale(LC_ALL, "Rus");
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	int N;
	cin >> N;
	cout << endl;
	int * array = new int [N];
	
	for (int i = 0; i < N; i++)
	{
		array[i] = i + 1;
		cout <<setw(5)<< array[i];		//отступ=максимальному разряду
		if ((i+1) % 10 == 0)			//печать по 10 элементов массива
			cout << endl;
	}
	cout << endl;
	delete [] array;
	return 0;
}