/*4.	Напишите программу, которая заполняет массив первыми N натуральными числами в обратном порядке (начиная с последнего) и выводит его.
Примеры
входные данные
	5
выходные данные
	5 4 3 2 1

*/
#include <iostream>
#include <string>
#include <windows.h>
#include <iomanip>
using namespace std;

int main() 
{
	setlocale(LC_ALL, "Rus");
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	int N=50;
	//cin>>N;
	cout << endl;
	
	
	int * array = new int [N];
	
	for (int i = N-1; i >= 0; i--)
	{
		array[i] = i+1;
		cout <<setw(5)<< array[i];		//отступ=максимальному разряду
		if (i % 10 == 0)			   //печать по 10 элементов массива
			cout << endl;
	}
	cout << endl;
	delete [] array;
	return 0;
}
