/*24. Напишите программу, которая выбирает в другой массив каждый третий элемент исходного массива, начиная с первого.
Входные данные
Первая строка содержит размер массива N . Во второй строке через пробел задаются N чисел – элементы массива. Гарантируется, что 0 < N ≤ 10000 .
Выходные данные
Программа должна вывести в одну строчку все элементы построенного массива, разделив их пробелами.
Примеры
входные данные
6
1 2 3 4 5 6
выходные данные
1 4

*/
#include <iostream>
#include <string>
#include <windows.h>
#include <iomanip>
#include <cmath>
#include <time.h>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Rus");
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	const int N = 13;
	int sizenew;
	if (N % 3 == 0)							//если размер исходного массива делится на 3, то размер нового массива будет N/3 если не делится то N/3+1
		sizenew = N / 3;				
	else sizenew = N / 3 + 1;
	int a = -10, b = 10;
	srand(time(NULL));
	int arr[N];
	int *arrtemp=new int[sizenew];			//на этапе компиляции не знаем какой размер массива будет, поэтому новый массив динамический
	
	cout << endl << "Массив состоит из следующих элементов:" << endl;
	for (int& el : arr)
	{
		el = a + rand() % (b - a + 1);
		cout << setw(4) << el;
		
	}
	
	//заполняем новый массив каждым третьим элементом
	for (int i = 0, j = 0; j < sizenew; j++, i += 3)
	{
		arrtemp[j] = arr[i];
	}

	cout << endl << "Новый массив:" << endl;
	for (int i = 0; i < sizenew; i++)
	{
		cout << setw(4) << arrtemp[i];
	}
	
	delete[] arrtemp;					//освобождаем память
	return 0;
}