/*15. Напишите программу, которая находит в массиве минимальный и максимальный из чётных положительных элементов.
Примеры
входные данные
6
-2 -1 2 3 5 6
выходные данные
2 6

*/
#include <iostream>
#include <string>
#include <windows.h>
#include <iomanip>
#include <cmath>
#include <time.h>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Rus");
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	const int N = 10;
	int a = -10, b = 10;
	
	

	srand(time(NULL));


	int arr [N];
	int min, max;

	cout << endl<< "Массив состоит из следующих элементов:"<<endl;
	for (int i = 0; i < N; i++)
	{
		arr[i] = a + rand() % (b-a+1);
		cout <<setw(4)<< arr[i];
		if ((arr[i] % 2) && (arr[i] > 0))
			min = arr[i], max = arr[i];					//максимальный и минимальный элемент первоначально приравнивается к последнему встреченному положительному и четному элементу
	}
	
	for (int el : arr)
	{
		if ((el % 2) && (el > 0))
		{
			if (el > max)
				max = el;
			if (el < min)
				min = el;
		}
			
	}
	cout <<"\nМинимальный и максимальный из положительных четных элементов:"<<endl<<min<<"   "<< max<<endl;
	
	return 0;
}