/*5.	Напишите программу, которая заполняет массив из N элементов в обратном порядке последовательными натуральными числами, начиная с последнего элемента, который должен быть равен X .
Примеры
входные данные
6 4
выходные данные
9 8 7 6


*/
#include <iostream>
#include <string>
#include <windows.h>
#include <iomanip>
using namespace std;

int main() 
{
	setlocale(LC_ALL, "Rus");
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	int N=50;
	int x = 100;
	//cin>>N;
	cout << endl;
	
	
	int * array = new int [N];
	
	for (int i = N-1; i >= 0; i--)
	{
		array[i] = i+x;
		cout <<setw(5)<< array[i];		//отступ=максимальному разряду
		if (i % 10 == 0)			   //печать по 10 элементов массива
			cout << endl;
	}
	cout << endl;
	delete [] array;
	return 0;
}
