/*14. Напишите программу, которая находит в массиве количество элементов, равных максимальному.
Примеры
входные данные
6
1 2 3 2 3 3
выходные данные
3 3

*/
#include <iostream>
#include <string>
#include <windows.h>
#include <iomanip>
#include <cmath>
#include <time.h>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Rus");
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	const int N = 10;
	int a = 0, b = 10;
	
	

	srand(time(NULL));


	int arr [N];
	
	cout << endl<< "Массив состоит из следующих элементов:"<<endl;
	for (int i = 0; i < N; i++)
	{
		arr[i] = a + rand() % (b-a+1);
		cout <<setw(4)<< arr[i];
	}
	int max = arr[0];					//максимальный элемент первоначально приравнивается к первому элементу
	for (int el : arr)
	{
		if (el > max)
			max = el;
	}
	cout <<endl<< max;
	
	return 0;
}