/*2. Напишите программу, которая заполняет массив из N элементов последовательными натуральными числами, начиная с X, и выводит его.
Входные данные
Входная строка содержит два целых числа: начальное значение X и размер массива N, разделённые пробелом. Гарантируется, что 0 < N ≤ 10000 .
Выходные данные
Программа должна вывести содержимое массива: N последовательных натуральных чисел, начиная с X.

*/
#include <iostream>
#include <string>
#include <windows.h>
#include <iomanip>
using namespace std;

int main() 
{
	setlocale(LC_ALL, "Rus");
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	int N=0;
	int x = 0;
	
	cout << endl;
	
	string xN = "50 10";
	//cin >> xN;							//если раскомментить, то можно вводить х и n с клавиатуры (обработка ошибочного ввода отсутствует)

	//Обработка строки и разделение на х и N 
	
	if (xN.find(' ')!=std::string::npos)		//проверка наличия пробелов
	{N = stoi(xN.substr(xN.find(' ')));
	x = stoi(xN.erase(xN.find(' ')));
	}
	
	int * array = new int [N];
	
	for (int i = 0; i < N; i++)
	{
		array[i] = i + x;
		cout <<setw(5)<< array[i];		//отступ=максимальному разряду
		if ((i+1) % 10 == 0)			//печать по 10 элементов массива
			cout << endl;
	}
	cout << endl;
	delete [] array;
	return 0;
}
