/*22. Напишите программу, которая отделяет положительные элементы массива от отрицательных: переставляет все положительные (в том же порядке) в начало массива, 
а все отрицательные (в том же порядке) – в конец массива, все нулевые элементы должны оказаться в середине массива.
Входные данные
Первая строка содержит размер массива N . Во второй строке через пробел задаются N чисел – элементы массива. Гарантируется, что 0 < N ≤ 10000 .
Выходные данные
Программа должна вывести в одну строчку все элементы получившегося массива, разделив их пробелами.
Примеры
входные данные
6
1 -1 2 -2 0 3
выходные данные
1 2 3 0 -1 -2


*/
#include <iostream>
#include <string>
#include <windows.h>
#include <iomanip>
#include <cmath>
#include <time.h>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Rus");
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	const int N = 10;
	int a = -10, b = 10;
	srand(time(NULL));
	int arr[N], arrtemp[N] = {0};
	
	cout << endl << "Массив состоит из следующих элементов:" << endl;
	for (int& el : arr)
	{
		el = a + rand() % (b - a + 1);
		cout << setw(4) << el;
	}
	
	//
	int j = 0;
	
	//В исходном массиве ищем все положительные элементы и записываем попорядку в новый массив, 
	//при окончании цикла в памяти останется индекс новго массива, с которого будут потом записываться либо 0, либо отрицательные числа
	for (int i = 0; i < N; i++, j++)
	{
		if (arr[i] > 0)
			arrtemp[j] = arr[i];
		else j--;
	}

	//Записываем в массив нули
	for (int i = 0; i < N; i++, j++)
	{
		if (arr[i] == 0)
			arrtemp[j] = arr[i];
		else j--;
	}

	//Записываем в массив отрицателные
	for (int i = 0; i < N; i++, j++)
	{
		if (arr[i] < 0)
			arrtemp[j] = arr[i];
		else j--;
	}

	cout << endl << "Новый массив:" << endl;
	for (int el : arrtemp)
	{
		cout << setw(4) << el;
	}

	return 0;
}