/*8. Напишите программу, которая заполняет массив из N элементов случайными целыми числами в диапазоне [ A , B ] и определяет количество чётных и количество нечётных элементов этого массива.
Примеры
входные данные
0 100 10
выходные данные
0 3 86 20 27 67 32 16 37 42
6 4


*/
#include <iostream>
#include <string>
#include <windows.h>
#include <iomanip>
#include <cmath>
#include <time.h>
using namespace std;

int main() 
{
	setlocale(LC_ALL, "Rus");
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	int N=100;
	int a = 5, b = 100;
	int kolvoChet = 0;
	int kolNechet = 0;
	//cin>>N;
	cout << endl;
	srand(time(NULL));
	
	
	int * array = new int [N];
	
	for (int i = 0; i <N; i++)			//N-1 т.к. элементы нумеруются с 0-го, соответственно конец массива это элемент [N-1]
	{
		array[i] = a + rand() % (b - a + 1);
		
		if (array[i] % 2 == 0)
			kolvoChet++;
		else kolNechet++;
		
		cout <<setw(5)<< array[i];
		if ((i + 1) % 10 == 0)
			cout << endl;
	}
	cout <<endl<<kolvoChet<<' '<<kolNechet<< endl;
	delete [] array;
	return 0;
}
