/*13. Напишите программу, которая выводит номера элементов массива, равных заданному значению X .
Примеры
входные данные
5
1 2 1 3 5
1
выходные данные
1 3


*/
#include <iostream>
#include <string>
#include <windows.h>
#include <iomanip>
#include <cmath>
#include <time.h>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Rus");
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	const int N = 10;
	int a = 0, b = 10;
	int X = 8;					//заданное значение Х
	int kolvoX = 0;

	srand(time(NULL));


	int array [N];
	cout << "X равен " << X << endl<< "Массив состоит из следующих элементов:"<<endl;
	for (int i = 0; i < N; i++)
	{
		array[i] = a + rand() % (b-a+1);
		cout <<setw(4)<< array[i];
	}
	cout << "\nНомера элементов равных значению " << X << " следующие: " << endl;
	for (int i = 0; i < N; i++)
	{
		if (array[i] == X)
			cout<<setw(4)<<i+1;
	}
	
	return 0;
}