/*10. Напишите программу, которая заполняет массив из N элементов случайными целыми числами в диапазоне [ A , B ] и определяет среднее арифметическое элементов этого массива.

*/
#include <iostream>
#include <string>
#include <windows.h>
#include <iomanip>
#include <cmath>
#include <time.h>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Rus");
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	int N = 10;
	int a = 0, b = 10;
	double sum = 0;
	int kolvo = 0;
	//cin>>N;
	cout << endl;
	srand(time(NULL));


	int* array = new int[N];
	for (int i = 0; i < N; i++)
	{
		array[i] = a + rand() % (b - a + 1);
		sum += array[i];
		kolvo++;
		cout << setw(5) << array[i];
	}
	cout << endl;
	if (kolvo != 0)
	{
		double sredAr = sum / kolvo;
		cout << "Среднее арифметическое = " << sredAr << endl << endl;
	}
	else cout << "Массив пуст" << endl << endl;

	delete[] array;
	return 0;
}