/*23. Напишите программу, которая выделяет в другой массив все элементы исходного массива, которые меньше нуля.
Входные данные
Первая строка содержит размер массива N . Во второй строке через пробел задаются N чисел – элементы массива. Гарантируется, что 0 < N ≤ 10000 .
Выходные данные
Программа должна вывести содержимое полученного массива: все отрицательные элементы исходного массива в том же порядке. Если таких нет, нужно вывести число 0.
Примеры
входные данные
6
1 -2 3 -4 5 -6
выходные данные
 -2 -4 -6
входные данные
6
1 2 3 4 5 6
выходные данные
0

*/
#include <iostream>
#include <string>
#include <windows.h>
#include <iomanip>
#include <cmath>
#include <time.h>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Rus");
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	const int N = 10;
	int sizenew = 0;
	int a = -10, b = 10;
	srand(time(NULL));
	int arr[N];
	
	cout << endl << "Массив состоит из следующих элементов:" << endl;
	for (int& el : arr)
	{
		el = a + rand() % (b - a + 1);
		cout << setw(4) << el;
		if (el < 0)
			sizenew += 1;					//считаем сколько отрицательных элементов в исходном массиве 
	}
	
	int j = 0;
	int *arrtemp=new int [sizenew];			//поскольку нужен новый массив с неизвестным на этапе компиляции размером,то используется динамический массив
	
	//Записываем в массив отрицательные
	for (int i = 0; i < N; i++, j++)
	{
		if (arr[i] < 0)
			arrtemp[j] = arr[i];
		else j--;
	}

	if (sizenew != 0)
	{
	cout << endl << "Новый массив:" << endl;
	for (int i = 0; i < sizenew; i++)
	{
		cout << setw(4) << arrtemp[i];
	}
	}
	else cout << '0' << endl;

	delete[] arrtemp;					//освобождение памяти
	return 0;
}